- Removing Rows

Lets assume we would like to remove certain rows. We can use the drop method as well but with different argument. We will need to provide drop method with the range of rows would like to remove and axis with the value of 0 which is the axis value for a row.

In [1]:
# Import pandas
import pandas as pd;

In [2]:
# load data from csv file into DataFrame
df = pd.read_csv('../../titanic.csv')

In [3]:
# Lets check first how many rows and columns exist
df.shape

(896, 12)

1. Remove a Range of Rows or a Specific Row

In [4]:
# Remove rows, 0 to 100 without changing the original DataFrame
data = df.drop(range(0, 100), axis=0)
data.shape
# df.shape should still have the same number of rows

(796, 12)

In [5]:
# Remove rows, 0 to 100 from the original DataFrame
df.drop(range(0, 100), axis=0, inplace=True)
df.shape

(796, 12)

2. Removing Duplicated Rows

For the purpose of this homework, we add duplicated rows in our titanic dataset csv file

In [6]:
# Use duplicated method to tell if a row is duplicated or no
df.duplicated()

100    False
101    False
102    False
103    False
104    False
       ...
891    False
892    False
893    False
894    False
895    False
Length: 796, dtype: bool

In [7]:
# Get number of duplicated rows in the dataset by adding sum method
df.duplicated().sum()

0

In [8]:
# To get a list of duplicated rows from the dataset, you can combine loc methode with duplicated method
df.loc[df.duplicated(), :] # Will not count the first row as duplicated

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [9]:
# To get a list of duplicated rows from the dataset including the first row or first accuruncy, add keep=False as argument in the duplicated method
df.loc[df.duplicated(keep=False), :] # Will add and count the first row as duplicated

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [10]:
# keep='first' means keep first rows of the duplicated series out of the list
df.loc[df.duplicated(keep='first'), :]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [11]:
# keep='last' means keep last rows of the duplicated series out of the list
df.loc[df.duplicated(keep='last'), :]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

NB. In most cases when we want to remove duplicated, I want to keep one instance of those rows so you don't have duplacted any more

In [12]:
df.shape

(796, 12)

In [13]:
# Remove duplicated but keep one instance on each duplicated rows
df.drop_duplicates(keep='first', inplace=True)
df.shape

(796, 12)

In [14]:
# To check duplication of value for a given column
df['Name'].duplicated()

100    False
101    False
102    False
103    False
104    False
       ...
891    False
892    False
893    False
894    False
895    False
Name: Name, Length: 796, dtype: bool

In [15]:
# To Get the sum or number of rows with duplicated value for a given columns
df['Name'].duplicated().sum()

0

In [16]:
# To remove rows with duplicated values in given columns
df['Name'].drop_duplicates(keep='first', inplace=True)
df.shape

(796, 12)

In [17]:
# Remove rows with duplicated values in all selected columns
dafr = pd.DataFrame({'name': ['Alice', 'Bob', 'Carol', 'Alice', 'Bob'], 'age': [25, 30, 35, 25, 40], 'city': ['Rockville', 'Germantown', 'Denver', 'Rome', 'Paris']})
dafr = dafr.drop_duplicates(subset=['name', 'age'])
dafr

    name  age        city
0  Alice   25   Rockville
1    Bob   30  Germantown
2  Carol   35      Denver
4    Bob   40       Paris